## pandas

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

1.0.5

## creating a series from list

In [4]:
order = [1,2,3.4,4,5,6,7]
arr = [2,4,2,32.0,32,12,21]
s1 = pd.Series(arr , index = order)
s1

1.0     2.0
2.0     4.0
3.4     2.0
4.0    32.0
5.0    32.0
6.0    12.0
7.0    21.0
dtype: float64

In [5]:
import numpy as np
arr = np.random.randn(5)
index = ['a','b','c','d','e']
s1 = pd.Series(arr, index = index)
s1

a    0.346417
b   -0.234539
c   -0.017863
d    1.239474
e   -0.798322
dtype: float64

In [6]:
dict = { 'a' : 123 , 'b' : 143 , 'c' : 121, 'd' : 111 , 'e' : 333}
s = pd.Series(dict)
s

a    123
b    143
c    121
d    111
e    333
dtype: int64

In [7]:
#slice
#right side means print upto that position
#left side means print after that position
s[3:]

d    111
e    333
dtype: int64

## Series Operations

In [8]:
arr1 = [1,2,3,4,5]
arr2 = [2,4,6,8,0]

In [9]:
s1 = pd.Series(arr1)
s2 = pd.Series(arr2)

In [10]:
s1.add(s2)

0     3
1     6
2     9
3    12
4     5
dtype: int64

In [11]:
s1.median()

3.0

##  Dataframe

In [14]:
date = pd.date_range('today',periods = 5) #define time sequence
date

DatetimeIndex(['2020-11-03 22:04:19.286959', '2020-11-04 22:04:19.286959',
               '2020-11-05 22:04:19.286959', '2020-11-06 22:04:19.286959',
               '2020-11-07 22:04:19.286959'],
              dtype='datetime64[ns]', freq='D')

In [16]:
data = {'name' : ["sun","bun","man","shimran","sat"],
        'age' : [1,2.3,5,7,8],
        'class' : ["1st" , "2nd" , "5th" , "7th" , "3rd"],
       }
index = ['a','b','c','d','e']
df = pd.DataFrame(data , index = index)
df

      name  age class
a      sun  1.0   1st
b      bun  2.3   2nd
c      man  5.0   5th
d  shimran  7.0   7th
e      sat  8.0   3rd

In [18]:
#data types of array
df.dtypes

name      object
age      float64
class     object
dtype: object

In [19]:
df.head()#first five
df.tail#last five
df.index #for index
df.values #for values
df.describe() #shows all stats

            age
count  5.000000
mean   4.660000
std    2.987976
min    1.000000
25%    2.300000
50%    5.000000
75%    7.000000
max    8.000000

In [20]:
df.T#from transpose

         a    b    c        d    e
name   sun  bun  man  shimran  sat
age      1  2.3    5        7    8
class  1st  2nd  5th      7th  3rd

In [23]:
df.sort_values(by = 'age')

      name  age class
a      sun  1.0   1st
b      bun  2.3   2nd
c      man  5.0   5th
d  shimran  7.0   7th
e      sat  8.0   3rd

In [24]:
df.loc['d','name'] =  'shampa'
df

     name  age class
a     sun  1.0   1st
b     bun  2.3   2nd
c     man  5.0   5th
d  shampa  7.0   7th
e     sat  8.0   3rd